In [1]:
import pandas as pd
import os
import tabula

from pathlib import Path

In [2]:
pd.set_option('max_rows', None)
pd.set_option('max_columns', None)

In [8]:
p = Path('C:/Users/602770/Downloads/volunteer/wec/student-data_raw')
files = list(p.glob('*.pdf'))

In [9]:
result = files[0:5]

In [11]:
result[0].name

'fall_2000.pdf'

In [12]:
!pwd

/c/Users/602770/downloads/volunteer/wec/notebooks/WEC

In [14]:
os.chdir('C:/Users/602770/Downloads/volunteer/wec/student-data_raw')

In [15]:
df = tabula.read_pdf(result[0].name, pages='all')

In [17]:
df.head()

,Student ID,Last Name,Fisrt Name,Age,Gender,Ethnicity,under 22,Income,Status,Zip Code,Education,Years in US
0,639784450,Aguilar,Martir,40,Male,NaN,No,NaN,NaN,20910,9,NaN
1,1116211479,Aispuro,Juan,40,Male,NaN,No,NaN,NaN,20010,12,NaN
2,1857407717,Alfaro-Santos,Eliseo,55,Male,NaN,No,NaN,NaN,20851,NaN,NaN
3,958588722,Alvarado,Balbina,63,Female,NaN,No,NaN,NaN,20854,6,NaN
4,1492966956,Alvarenga,Edgar,42,Male,NaN,No,NaN,Not Employed,20011,2,NaN